load-data-user.yml
config:
  target: 'https://cc2526.azurewebsites.net/rest'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  processor: "./test-utils.js"
  phases:
    - name: "Create users"
      duration: 1
      arrivalCount: 1

scenarios:
  - name: 'Create users'
    weight: 1
    flow:
      - loop:
          - function: "genNewUser"
          - post:
              url: "/user"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                id: "{{ uId }}"
                name: "{{ uName }}"
                pwd: "{{ uPwd }}"
                photoId: "{{ imageId }}"
                legoIds: []
              afterResponse: "genNewUserReply"
          - post:
              url: "/user/auth"
              headers:
                Content-Type: application/json
              json:
                user: "{{ uId }}"
                pwd: "{{ uPwd }}"
        count: 200