load-data.yml
config:
  target: 'https://cc2526.azurewebsites.net'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  processor: "./test-utils.js"
  phases:
  - name: "Create users"    # Create users
    duration: 1
    arrivalCount: 1

scenarios:
  - name: 'Create users'
    weight: 1
    flow:
      - loop:
        - post:
            url: "/rest/media"
            headers:
              Content-Type: image/jpeg
              Accept: application/json
            beforeRequest: "uploadImageBody"
            capture: 
              regexp: '"([^"]+)"'
              as: "imageId"              # capture the reply as image id to be used in user creation
        - function: "genNewUser"         # Generate the needed information for the user
        - post:
            url: "/rest/user"
            headers:
              Content-Type: application/json
              Accept: application/json
            json:
              id: "{{ uId }}"
              name: "{{ uName }}"
              pwd: "{{ uPwd }}"
              photoId: "{{ imageId }}"
              legoIds: []
            afterResponse: "genNewUserReply"    # capture result and store in file
        - post:
            url: "/rest/user/auth"
            headers:
              Content-Type: application/json
            beforeRequest: "debugRequest"
            json:
              user: "{{ uId }}"
              pwd: "{{ uPwd }}"
        count: 200
      - loop:
        - post:
            url: "/rest/media"
            headers:
              Content-Type: image/jpeg
              Accept: application/json
            beforeRequest: "uploadImageBody"
            capture: 
              regexp: '"([^"]+)"'
              as: "imageId"              # capture the reply as image id to be used in legoset creation
        - function: "genNewLegoSet"         # Generate the needed information for the legoset
        - function: "selectUser"             # Select a user to be the owner
        - post:
            url: "/rest/legoset"
            headers:
              Content-Type: application/json
              Accept: application/json
            json:
              name: "{{ lsName }}"
              codeNumber: "{{ lsCodeNumber }}"
              description: "{{ lsDescription }}"
              photoId: "{{ imageId }}"
              ownerId: "{{ uId }}"
            afterResponse: "logResponse"
            capture: 
              json: "$.id"
              as: "lsId"              # capture the legoset id to be used in adding legosets to users
        - loop:
          - function: "selectUser"   # select a user to own this legoset
          - post:
              url: "/rest/user/auth"
              headers:
                Content-Type: application/json
              beforeRequest: "debugRequest"
              json:
                user: "{{ uId }}"
                pwd: "{{ uPwd }}"
          - patch:
              url: "/rest/user/{{ uId }}"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                legoIds: ["{{ lsId }}"]
          whileTrue: "randomLoop90"
        - loop:
          - function: "genProductComment"   # generate a comment for the product
          - post:
              url: "/rest/user/auth"
              headers:
                Content-Type: application/json
              beforeRequest: "debugRequest"
              json:
                user: "{{ uId }}"
                pwd: "{{ uPwd }}"
          - patch:
              url: "/rest/user/{{ uId }}"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                legoIds: ["{{ lsId }}"]
          - post:
              url: "/rest/legoset/{{ lsId }}/comment"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                legoSetId: "{{ lsId }}"
                userId: "{{ uId }}"
                commentText: "{{ cmtText }}"
          whileTrue: "randomLoop90"
        - loop:
          - function: "genNewOldAuction"   # generate a auction for the product
          - post:
              url: "/rest/user/auth"
              headers:
                Content-Type: application/json
              beforeRequest: "debugRequest"
              json:
                user: "{{ uId }}"
                pwd: "{{ uPwd }}"
          - patch:
              url: "/rest/user/{{ uId }}"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                legoIds: ["{{ lsId }}"]
          - post:
              url: "/rest/auction"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                legoSetId: "{{ lsId }}"
                sellerId: "{{ uId }}"          # changed from 'seller'
                basePrice: {{ basePrice }}     # changed from 'startingPrice' -> numeric
                closeDate: {{ closeDate }}     # changed from 'endDate' -> numeric epoch ms
              capture: 
                json: "$.id"
                as: "aucId"         # capture the auction id to be used in bid creation
          - loop:
            - function: "genNewOldBid"
            - post:
                url: "/rest/user/auth"
                headers:
                  Content-Type: application/json
                beforeRequest: "debugRequest"
                json:
                  user: "{{ uId }}"
                  pwd: "{{ uPwd }}"
            - post:
                url: "/rest/auction/{{ aucId }}/bid"
                headers:
                  Content-Type: application/json
                  Accept: application/json
                json:
                  userId: "{{ uId }}"         # send only fields server expects
                  amount: {{ amount }}
                  timestamp: {{ timestamp }}
            whileTrue: "randomLoop90"
          whileTrue: "randomLoop70"
        count: 500