load-data.yml
config:
  target: 'http://localhost:8080/rest'
  http:
    timeout: 20000
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  processor: "./processor.js"
  phases:
  - name: "Create users"
    duration: 10
    arrivalCount: 1

scenarios:
  - name: 'Create users'
    weight: 1
    flow:
      - loop:
        - post:
            url: "/media"
            headers:
              Content-Type: image/jpeg
              Accept: application/json
            beforeRequest: "uploadImageBody"
            capture:
              regexp: "(.+)"
              as: "imageId"
        - function: "genNewUser"
        - post:
            url: "/user"
            headers:
              Content-Type: application/json
              Accept: application/json
            json:
              id: "{{ uId }}"
              name: "{{ uName }}"
              pwd: "{{ uPwd }}"
              photoId: "{{ imageId }}"
              legoIds: []
            afterResponse: "genNewUserReply"
        - post:
            url: "/user/auth"
            headers:
              Content-Type: application/json
            json:
              user: "{{ uId }}"
              pwd: "{{ uPwd }}"
        count: 5
      - loop:
        - post:
            url: "/media"
            headers:
              Content-Type: image/jpeg
              Accept: application/json
            beforeRequest: "uploadImageBody"
            capture:
              regexp: "(.+)"
              as: "imageId"
        - function: "genNewLegoSet"
        - post:
            url: "/legoset"
            headers:
              Content-Type: application/json
              Accept: application/json
            json:
              name: "{{ lsName }}"
              description: "{{ lsDescription }}"
              photoIds: ["{{ imageId }}"]
            capture:
              json: "$.id"
              as: "lsId"
        count: 10